VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/DataSheetSpecExamples/TABLE1.2/F85x_ADC_Burst_Mode/F85x_ADC_Burst_Mode.c
//-----------------------------------------------------------------------------
// F85x_ADC_Burst_Mode.c
//-----------------------------------------------------------------------------
// Copyright 2013 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//
//
// Refer to F85x_ADC_Bust_Mode_Readme.txt for more information regarding the
// functionality of this code example.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Ext Ref, 200 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Measure the current across Imeasure. This is the current with the ADC
//    burst mode enabled.
// 6) Use the switch at P2.1 (S2) to disable the ADC.
// 7) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    external reference sampling at 200 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Ext Ref, 100 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) once. This will initialize the ADC for 10
//    bit burst mode using the external reference and sampling rate of 100 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    external reference sampling at 100 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Ext Ref, 10 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) twice. This will initialize the ADC for 10
//    bit burst mode using the external reference and sampling rate of 10 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    external reference sampling at 10 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Int Ref, 200 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) three times. This will initialize the ADC
//    for 10 bit burst mode using the internal reference and sampling rate of
//    200 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    internal reference sampling at 200 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Int Ref, 100 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) four times. This will initialize the ADC
//    for 10 bit burst mode using the internal reference and sampling rate of
//    100 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    internal reference sampling at 100 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 10 Bit, Int Ref, 10 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) five times. This will initialize the ADC
//    for 10 bit burst mode using the internal reference and sampling rate of
//    10 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 10 bit single conversions,
//    internal reference sampling at 10 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Ext Ref, 100 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) six times. This will initialize the ADC
//    for 12 bit burst mode using the external reference and sampling rate of
//    100 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    external reference sampling at 100 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Ext Ref, 50 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) seven times. This will initialize the ADC
//    for 12 bit burst mode using the external reference and sampling rate of
//    50 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    external reference sampling at 50 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Ext Ref, 10 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) eight times. This will initialize the ADC
//    for 12 bit burst mode using the external reference and sampling rate of
//    10 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    external reference sampling at 10 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Int Ref, 100 ksps):
// ------------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) nine times. This will initialize the ADC
//    for 12 bit burst mode using the internal reference and sampling rate of
//    100 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    internal reference sampling at 100 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Int Ref, 50 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) ten times. This will initialize the ADC
//    for 12 bit burst mode using the internal reference and sampling rate of
//    50 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    internal reference sampling at 50 ksps under Table 1.2.
//
//
// How To Measure (Table 1.2 - ADC0 Burst Mode, 12 Bit, Int Ref, 10 ksps):
// -----------------------------------------------------------------------
// 1) Ensure a shorting block is placed across Imeasure (JP2).
// 2) Place VDD Select (SW1) in the +3.3V_VREG position and power the board
//    using the J6 power connector.
// 3) Download and run the code on the target board.
// 4) Remove all of the shorting blocks on the board except for the block(s)
//    across the following pins:
//    a) POT and P1.2 on J27
//    b) S1 and P1.7 on J27
//    c) S2 and P2.1 on J27
// 5) Press the switch at P1.7 (S1) eleven times. This will initialize the ADC
//    for 12 bit burst mode using the internal reference and sampling rate of
//    10 ksps.
// 6) Measure the current across Imeasure. This reading is the current with
//    the ADC burst mode enabled.
// 7) Use the switch at P2.1 (S2) to disable the ADC.
// 8) Record the current reading and subtract the value from the previously
//    recorded value. Verify the difference is within the range of the values
//    listed on the datasheet for ADC0 Burst Mode, 12 bit single conversions,
//    internal reference sampling at 10 ksps under Table 1.2.
//
//
// Target:         C8051F85x/86x
// Target Board:   UPMU-F850 MCU-100
// Tool Chain:     Generic
// Command Line:   None
//
//
// Release 1.0
//    - Initial Revision (BGD)
//    - 25 JUL 2013
//
//-----------------------------------------------------------------------------

