VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/DataSheetSpecExamples/TABLE1.2/F85x_ADC_Burst_Mode/F85x_ADC_Burst_Mode.c
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------

#include <compiler_defs.h>
#include <C8051F850_defs.h>            // SFR declarations

//-----------------------------------------------------------------------------
// Global Constants
//-----------------------------------------------------------------------------

#define SYSCLK             24500000    // SYSCLK frequency in Hz

#define SARCLK_HIGH_SPEED  12250000    // High speed SARCLK frequency in Hz
#define SARCLK_LOW_POWER   4000000     // Low power SARCLK frequency in Hz

#define SW_PRESSED         0
#define SW_NOT_PRESSED     1

#define ADC0_EXT_REF       0
#define ADC0_INT_REF       1

#define ADC0_10_BIT        0
#define ADC0_12_BIT        1

#define ADC0_BURST_10_BIT_EXT_REF_200_KSPS   0x00
#define ADC0_BURST_10_BIT_EXT_REF_100_KSPS   0x01
#define ADC0_BURST_10_BIT_EXT_REF_10_KSPS    0x02
#define ADC0_BURST_10_BIT_INT_REF_200_KSPS   0x03
#define ADC0_BURST_10_BIT_INT_REF_100_KSPS   0x04
#define ADC0_BURST_10_BIT_INT_REF_10_KSPS    0x05
#define ADC0_BURST_12_BIT_EXT_REF_100_KSPS   0x06
#define ADC0_BURST_12_BIT_EXT_REF_50_KSPS    0x07
#define ADC0_BURST_12_BIT_EXT_REF_10_KSPS    0x08
#define ADC0_BURST_12_BIT_INT_REF_100_KSPS   0x09
#define ADC0_BURST_12_BIT_INT_REF_50_KSPS    0x0A
#define ADC0_BURST_12_BIT_INT_REF_10_KSPS    0x0B


//-----------------------------------------------------------------------------
// Pin Definitions
//-----------------------------------------------------------------------------

SBIT(S1, SFR_P1, 7);                   // Switch 1
SBIT(S2, SFR_P2, 1);                   // Switch 2

//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------

void ADC0_Init(U8,U8);
void SYSCLK_Init (void);
void Port_Init (void);
void Timer2_Init (U32);

INTERRUPT_PROTO (ADC_ISR, INTERRUPT_ADC0_EOC);

//-----------------------------------------------------------------------------
// main() Routine
//-----------------------------------------------------------------------------
void main (void)
{
   // Local variables
   U8 nextTestMode = ADC0_BURST_10_BIT_EXT_REF_100_KSPS;
   U16 debounceCounter;

   // Disable the watchdog timer
   WDTCN = 0xDE;
   WDTCN = 0xAD;

   ADC0_Init (ADC0_EXT_REF,            // Initialize ADC0 to use external ref,
              ADC0_10_BIT);            // 10 bit conversions
   SYSCLK_Init ();                     // Initialize system clock to 24.5 MHz
   Port_Init ();                       // Initialize crossbar and GPIO
   Timer2_Init (200000);               // Init Timer2 to generate overflows
                                       // to trigger ADC at 200 kHz

   EA = 1;                             // Enable global interrupts

   // Loop forever
   while (1)
   {
      if ((S1 == SW_PRESSED) && (S2 != SW_PRESSED))
      {
         switch (nextTestMode)
         {
            case ADC0_BURST_10_BIT_EXT_REF_200_KSPS:
               // Setup ADC0 to use external reference, 10 bit conversions
               ADC0_Init (ADC0_EXT_REF, ADC0_10_BIT);

               // Init Timer2 to generate overflows to trigger ADC at 200 kHz
               Timer2_Init (200000);

               nextTestMode = ADC0_BURST_10_BIT_EXT_REF_100_KSPS;
               break;

            case ADC0_BURST_10_BIT_EXT_REF_100_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 100 kHz
               Timer2_Init (100000);

               nextTestMode = ADC0_BURST_10_BIT_EXT_REF_10_KSPS;
               break;

            case ADC0_BURST_10_BIT_EXT_REF_10_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 10 kHz
               Timer2_Init (10000);

               nextTestMode = ADC0_BURST_10_BIT_INT_REF_200_KSPS;
               break;

            case ADC0_BURST_10_BIT_INT_REF_200_KSPS:
               // Setup ADC0 to use internal reference at 1.65V, 10 bit
               // conversions
               ADC0_Init (ADC0_INT_REF, ADC0_10_BIT);

               // Init Timer2 to generate overflows to trigger ADC at 200 kHz
               Timer2_Init (200000);

               nextTestMode = ADC0_BURST_10_BIT_INT_REF_100_KSPS;
               break;

            case ADC0_BURST_10_BIT_INT_REF_100_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 100 kHz
               Timer2_Init (100000);

               nextTestMode = ADC0_BURST_10_BIT_INT_REF_10_KSPS;
               break;

            case ADC0_BURST_10_BIT_INT_REF_10_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 10 kHz
               Timer2_Init (10000);

               nextTestMode = ADC0_BURST_12_BIT_EXT_REF_100_KSPS;
               break;

            case ADC0_BURST_12_BIT_EXT_REF_100_KSPS:
               // Setup ADC0 to use external reference, 12 bit conversions
               ADC0_Init (ADC0_EXT_REF, ADC0_12_BIT);

               // Init Timer2 to generate overflows to trigger ADC at 100 kHz
               Timer2_Init (100000);

               nextTestMode = ADC0_BURST_12_BIT_EXT_REF_50_KSPS;
               break;

            case ADC0_BURST_12_BIT_EXT_REF_50_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 50 kHz
               Timer2_Init (50000);

               nextTestMode = ADC0_BURST_12_BIT_EXT_REF_10_KSPS;
               break;

            case ADC0_BURST_12_BIT_EXT_REF_10_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 10 kHz
               Timer2_Init (10000);

               nextTestMode = ADC0_BURST_12_BIT_INT_REF_100_KSPS;
               break;

            case ADC0_BURST_12_BIT_INT_REF_100_KSPS:
               // Setup ADC0 to use internal reference at 1.65V
               REF0CN = 0x18;

               // Init Timer2 to generate overflows to trigger ADC at 100 kHz
               Timer2_Init (100000);

               nextTestMode = ADC0_BURST_12_BIT_INT_REF_50_KSPS;
               break;

            case ADC0_BURST_12_BIT_INT_REF_50_KSPS:
               // Setup ADC0 to use internal reference at 1.65V, 12 bit
               // conversions
               ADC0_Init (ADC0_INT_REF, ADC0_12_BIT);

               // Init Timer2 to generate overflows to trigger ADC at 50 kHz
               Timer2_Init (50000);

