VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/DataSheetSpecExamples/TABLE1.2/F85x_ADC_Burst_Mode/F85x_ADC_Burst_Mode.c
               nextTestMode = ADC0_BURST_12_BIT_INT_REF_10_KSPS;
               break;

            case ADC0_BURST_12_BIT_INT_REF_10_KSPS:
               // Init Timer2 to generate overflows to trigger ADC at 10 kHz
               Timer2_Init (10000);

               nextTestMode = ADC0_BURST_10_BIT_EXT_REF_200_KSPS;
               break;

            default:
               // Error: Undefined state for nextTestMode
               while (1);
         }

         ADBMEN = 1;                   // Enable burst mode

         while (S1 == SW_PRESSED);     // Block until switch 1 is released

         for(debounceCounter = 0; debounceCounter < 20000; debounceCounter++);
      }

      else if ((S1 != SW_PRESSED) && (S2 == SW_PRESSED))
      {
         ADBMEN = !ADBMEN;             // Toggle ADC burst mode enable

         while (S2 == SW_PRESSED);     // Block until switch 2 is released

         for(debounceCounter = 0; debounceCounter < 20000; debounceCounter++);
      }

      // If both or none of the switches are pressed
      else
      {
         // Preserve state variables
         nextTestMode = nextTestMode;
      }
   }
}

//-----------------------------------------------------------------------------
// Initialization Subroutines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// ADC0_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    reference
//                resolution
//
// This routine uses the parameters reference and resolution to initialize the
// ADC for the test being performed. The reference can be either external or
// internal. The resolution can be either 10 bit or 12 bit.
//
//-----------------------------------------------------------------------------
void ADC0_Init (U8 reference, U8 resolution)
{
   ADC0CN0 = 0x42;                     // ADC0 disabled, burst mode enabled,
                                       // conversions triggered on Timer2
                                       // overflows

   ADC0CN1 |= 0x01;                    // Enable common mode buffer

   ADC0MX = 0x0A;                      // ADC0 positive input = ADC0.10 or
                                       // P1.2

   // Setup ADC0 for 12 bit conversions
   if(resolution == ADC0_12_BIT)
   {
      ADC0AC = 0x81;                   // 12-bit mode enabled, right-
                                       // justified, repeat count set to 1

      // ADC0 reference is internal
      if(reference == ADC0_INT_REF)
      {
         // Set SAR clock to 4 MHz
         ADC0CF = ((SYSCLK/SARCLK_LOW_POWER)-1)<<3;

         ADC0PWR = 0xF4;               // Enable Low Power settings

         ADC0TK = 0x34;                // Setup tracking time for 12 bit burst
                                       // mode using internal reference

         REF0CN = 0x18;                // Ground reference is the GND pin,
                                       // voltage reference is the internal
                                       // reference at 1.65V, temperature
                                       // sensor disabled
      }

      // ADC0 reference is external
      else
      {
         // Set SAR clock to 12.25 MHz
         ADC0CF = ((SYSCLK/SARCLK_HIGH_SPEED)-1)<<3;

         ADC0PWR = 0x44;               // Low power mode disabled, bias
                                       // current mode 2

         ADC0TK = 0x3A;                // Setup tracking time for 12 bit burst
                                       // mode using external reference

         REF0CN = 0x08;                // Ground reference is the GND pin,
                                       // voltage reference is the VDD pin,
                                       // temperature sensor disabled
      }
   }

   // Setup ADC0 for 10 bit conversions
   else
   {
      ADC0AC = 0x00;                   // 12 bit mode disabled, accumulation
                                       // disabled, right-justified, repeat
                                       // count set to 1

      // ADC0 reference is internal
      if(reference == ADC0_INT_REF)
      {
         // Set SAR clock to 4 MHz
         ADC0CF = ((SYSCLK/SARCLK_LOW_POWER)-1)<<3;

         ADC0PWR = 0xF4;               // Enable Low Power settings

         ADC0TK = 0x34;                // Setup tracking time for 10 bit burst
                                       // mode using internal reference

         REF0CN = 0x18;                // Ground reference is the GND pin,
                                       // voltage reference is the internal
                                       // reference at 1.65V, temperature
                                       // sensor disabled
      }

      // ADC0 reference is external
      else
      {
         // Set SAR clock to 12.25 MHz
         ADC0CF = ((SYSCLK/SARCLK_HIGH_SPEED)-1)<<3;

         ADC0PWR = 0x44;               // Low power mode disabled, bias
                                       // current mode 2

         ADC0TK = 0x3A;                // Setup tracking time for 10 bit burst
                                       // mode using external reference

         REF0CN = 0x08;                // Ground reference is the GND pin,
                                       // voltage reference is the VDD pin,
                                       // temperature sensor disabled
      }
   }

   ADC0CF |= 0x01;                     // 1x gain, normal tracking mode,
                                       // 10 bit/12 bit mode

   EIE1 |= 0x08;                       // Enable ADC0 conversion complete
                                       // interrupt
}

//-----------------------------------------------------------------------------
// SYSCLK_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// This routine initializes the system clock to use the internal 24.5 MHz
// oscillator divided by 1 as its clock source.  Also enables missing clock
// detector reset.
//
//-----------------------------------------------------------------------------
void SYSCLK_Init (void)
{
   RSTSRC = 0x06;                      // Enable missing clock detector and
                                       // leave VDD Monitor enabled.
   CLKSEL = 0x00;                      // Set system clock to 24.5 MHz
}

