VladimirP1/si1000-rf-beacon/extlibs/MCU/Examples/C8051F85x_86x/DataSheetSpecExamples/TABLE1.2/F85x_ADC_Burst_Mode/F85x_ADC_Burst_Mode.c
//-----------------------------------------------------------------------------
// Port_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure the Crossbar and GPIO ports based on the characteristics under
// test.
//
// P1.2  analog               ADC0.10
// P1.7  digital  open-drain  S1 (Switch 1)
// P2.1  digital  open-drain  S2 (Switch 2)
//
//-----------------------------------------------------------------------------
void Port_Init (void)
{
   // Port 1 Initialization
   P1MDIN &= ~0x04;                    // Set P1.2 as an analog input
   P1SKIP |= 0x04;                     // Skip P1.2 on crossbar
   P1MDOUT &= ~0x80;                   // Set P1.7 as open-drain
   P1 |= 0x84;                         // Set the P1.2 and P1.7 latch to '1'

   // Port 2 Initialization
   P2MDOUT &= ~0x02;                   // Set P2.1 as open-drain
   P2 |= 0x02;                         // Set the P2.1 latch to '1'

   XBR2 = 0x40;                        // Enable crossbar and weak pull-ups
}

//-----------------------------------------------------------------------------
// Timer2_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    samplingRate
//
// Configure Timer2 to 16 bit auto-reload and generate an interrupt at the rate
// specified by samplingRate. Timer 2 overflow automatically triggers ADC0
// conversion. The Timer2 interrupt is enabled and used to clear the ADC
// interrupt when the user is not testing the throughput of the ADC.
//
//-----------------------------------------------------------------------------
void Timer2_Init (U32 samplingRate)
{
   TMR2CN = 0x00;                      // Stop Timer2 and clear TF2
                                       // Use SYSCLK as time base, 16 bit
                                       // auto-reload
   CKCON |= 0x10;                      // Select SYSCLK for Timer2 source

   // Set reload for ADC0 sampling rate
   TMR2RL = -((SYSCLK/samplingRate) + 1);

   TMR2 = 0xFFFF;                      // Set to reload immediately

   TR2 = 1;                            // Start Timer2
}

//-----------------------------------------------------------------------------
// Interrupt Service Routines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// ADC0_ISR
//-----------------------------------------------------------------------------
//
// This ISR is called after each ADC conversion which is triggered by Timer2.
//
//-----------------------------------------------------------------------------
INTERRUPT (ADC_ISR, INTERRUPT_ADC0_EOC)
{
   ADINT = 0;                          // Clear ADC0 conv. complete flag
}

//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
